math/function-compose-type-cut--demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-03 Wed 23:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>function compose, type cut, and the algebra of logic</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="../asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
近死之心 莫使復陽也
</div>
<div id="content">
<h1 class="title">function compose, type cut, and the algebra of logic</h1>
<hr  />
<hr  />
<hr  />

<ul class="org-ul">
<li><p><p></p><p>Curry–Howard correspondence</p><p>type as proposition</p><p>function body as proof</p><p>a proof is a record of many steps of deduction</p><p></p></p><p></p><p><p></p><p>main idea</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">syntax</th></p><p><th scope="col" class="org-left">deduction system</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">function application</td></p><p><td class="org-left">natural deduction</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">function composition</td></p><p><td class="org-left">sequent calculus</td></p><p></tr></p><p></tbody></p><p></table></p></li></ul>

<hr  />
<hr  />
<hr  />

<ul class="org-ul">
<li><p>some said,</p><p>[for example, see the wikipedia page of "Curry–Howard correspondence", at the time when this paper is written]</p><p>in the framework of Curry–Howard correspondence,</p><p>Gentzen's sequent calculus does not correspond with</p><p>a well-defined pre-existing model of computation,</p><p>as it was for Hilbert-style and natural deduction.</p><p></p><p><ul class="org-ul"></p><p><li><p>in this paper, I will show that</p><p>we can get what sequent calculus corresponds to,</p><p>not by designing a new model of computation,</p><p>but by changing the syntax of well known model.</p></li></p><p></p><p><li><p>I will show that</p><p>sequent calculus corresponds to a functional programming language,</p><p>the syntax of which is optimized for function composition</p><p>instead of function application.</p></li></p><p></p><p><li><p>I will also show the trade-off of this syntax design.</p><p><ol class="org-ol"></p><p><li>the syntax of type and function-body are unified.</li></p><p><li>we lose the implicit syntax for currying.</li></p><p><li>we gain the algebraic associative law.</li></ol></p></li></ul></p></li></ul>

<hr  />
<hr  />
<hr  />

<ul class="org-ul">
<li><p>some also said, [for example, see the first chapter of "Homotopy Type Theory"]</p><p>deduction system can be viewed as algebraic structure,</p><p>where theorems are the elements (like elements of group),</p><p>where deductive rules are the operations (like multiplication of group).</p><p></p><p><ul class="org-ul"></p><p><li><p>in this paper, I will show that</p><p>with the associative law which we obtained from function composition,</p><p>the corresponding deduction system of our programming language</p><p>not merely "can be viewed as" algebraic structure,</p><p>but actually has a very rich algebraic structure.</p></li></ul></p></li>

<li><p>I will also introduce a prototype implementation of such a language.</p><p>I call it "sequent1".</p></li></ul>

<hr  />
<hr  />
<hr  />
</div>
<div id="postamble" class="status">
近死之心 莫使復陽也
</div>
</body>
</html>
